podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/DeviceData/Device.SVD/Internal/peripherals/DMA_MKE16F16.svd.xml
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>ECX</name>
                     <description>Error Cancel Transfer</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Normal operation</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Cancel the remaining data transfer in the same fashion as the CX bit. Stop the executing channel and force the minor loop to finish. The cancel takes effect after the last write of the current read/write sequence. The ECX bit clears itself after the cancel is honored. In addition to cancelling the transfer, ECX treats the cancel as an error condition, thus updating the Error Status register (DMAx_ES) and generating an optional error interrupt</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>CX</name>
                     <description>Cancel Transfer</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Normal operation</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Cancel the remaining data transfer. Stop the executing channel and force the minor loop to finish. The cancel takes effect after the last write of the current read/write sequence. The CX bit clears itself after the cancel has been honored. This cancel retires the channel normally as if the minor loop was completed</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>ES</name>
               <description>Error Status Register</description>
               <addressOffset>0x4</addressOffset>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>DBE</name>
                     <description>Destination Bus Error</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>No destination bus error</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>The last recorded error was a bus error on a destination write</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>SBE</name>
                     <description>Source Bus Error</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>No source bus error</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>The last recorded error was a bus error on a source read</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>SGE</name>
                     <description>Scatter/Gather Configuration Error</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>No scatter/gather configuration error</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>The last recorded error was a configuration error detected in the TCDn_DLASTSGA field. This field is checked at the beginning of a scatter/gather operation after major loop completion if TCDn_CSR[ESG] is enabled. TCDn_DLASTSGA is not on a 32 byte boundary</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>NCE</name>
                     <description>NBYTES/CITER Configuration Error</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>No NBYTES/CITER configuration error</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>The last recorded error was a configuration error detected in the TCDn_NBYTES or TCDn_CITER fields. TCDn_NBYTES is not a multiple of TCDn_ATTR[SSIZE] and TCDn_ATTR[DSIZE], or TCDn_CITER[CITER] is equal to zero, or TCDn_CITER[ELINK] is not equal to TCDn_BITER[ELINK]</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>DOE</name>
                     <description>Destination Offset Error</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>No destination offset configuration error</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>The last recorded error was a configuration error detected in the TCDn_DOFF field. TCDn_DOFF is inconsistent with TCDn_ATTR[DSIZE]</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>DAE</name>
                     <description>Destination Address Error</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>No destination address configuration error</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>The last recorded error was a configuration error detected in the TCDn_DADDR field. TCDn_DADDR is inconsistent with TCDn_ATTR[DSIZE]</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>SOE</name>
                     <description>Source Offset Error</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>No source offset configuration error</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>The last recorded error was a configuration error detected in the TCDn_SOFF field. TCDn_SOFF is inconsistent with TCDn_ATTR[SSIZE]</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>SAE</name>
                     <description>Source Address Error</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>No source address configuration error</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>The last recorded error was a configuration error detected in the TCDn_SADDR field. TCDn_SADDR is inconsistent with TCDn_ATTR[SSIZE]</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>ERRCHN</name>
                     <description>Error Channel Number or Canceled Channel Number</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>CPE</name>
                     <description>Channel Priority Error</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>No channel priority error</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>The last recorded error was a configuration error in the channel priorities . Channel priorities are not unique</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>ECX</name>
                     <description>Transfer Canceled</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>No canceled transfers</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>The last recorded entry was a canceled transfer by the error cancel transfer input</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>VLD</name>
                     <description>Logical OR of all ERR status bits</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>No ERR bits are set</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>At least one ERR bit is set indicating a valid error exists that has not been cleared</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>ERQ</name>
               <description>Enable Request Register</description>
               <addressOffset>0xC</addressOffset>
               <fields>
                  <field>
                     <name>ERQ0</name>
                     <description>Enable DMA Request 0</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>The DMA request signal for the corresponding channel is disabled</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>The DMA request signal for the corresponding channel is enabled</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field derivedFrom="ERQ0" > <name>ERQ1</name> <description>Enable DMA Request 1</description> <bitOffset>1</bitOffset> </field>
                  <field derivedFrom="ERQ0" > <name>ERQ2</name> <description>Enable DMA Request 2</description> <bitOffset>2</bitOffset> </field>
                  <field derivedFrom="ERQ0" > <name>ERQ3</name> <description>Enable DMA Request 3</description> <bitOffset>3</bitOffset> </field>
                  <field derivedFrom="ERQ0" > <name>ERQ4</name> <description>Enable DMA Request 4</description> <bitOffset>4</bitOffset> </field>
                  <field derivedFrom="ERQ0" > <name>ERQ5</name> <description>Enable DMA Request 5</description> <bitOffset>5</bitOffset> </field>
                  <field derivedFrom="ERQ0" > <name>ERQ6</name> <description>Enable DMA Request 6</description> <bitOffset>6</bitOffset> </field>
                  <field derivedFrom="ERQ0" > <name>ERQ7</name> <description>Enable DMA Request 7</description> <bitOffset>7</bitOffset> </field>
                  <field derivedFrom="ERQ0" > <name>ERQ8</name> <description>Enable DMA Request 8</description> <bitOffset>8</bitOffset> </field>
                  <field derivedFrom="ERQ0" > <name>ERQ9</name> <description>Enable DMA Request 9</description> <bitOffset>9</bitOffset> </field>
                  <field derivedFrom="ERQ0" > <name>ERQ10</name> <description>Enable DMA Request 10</description> <bitOffset>10</bitOffset> </field>
                  <field derivedFrom="ERQ0" > <name>ERQ11</name> <description>Enable DMA Request 11</description> <bitOffset>11</bitOffset> </field>
                  <field derivedFrom="ERQ0" > <name>ERQ12</name> <description>Enable DMA Request 12</description> <bitOffset>12</bitOffset> </field>
                  <field derivedFrom="ERQ0" > <name>ERQ13</name> <description>Enable DMA Request 13</description> <bitOffset>13</bitOffset> </field>
                  <field derivedFrom="ERQ0" > <name>ERQ14</name> <description>Enable DMA Request 14</description> <bitOffset>14</bitOffset> </field>
                  <field derivedFrom="ERQ0" > <name>ERQ15</name> <description>Enable DMA Request 15</description> <bitOffset>15</bitOffset> </field>
               </fields>
            </register>
            <register>
               <name>EEI</name>
               <description>Enable Error Interrupt Register</description>
               <addressOffset>0x14</addressOffset>
               <fields>
                  <field>
                     <name>EEI0</name>
                     <description>Enable Error Interrupt 0</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>The error signal for corresponding channel does not generate an error interrupt</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>The assertion of the error signal for corresponding channel generates an error interrupt request</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field derivedFrom="EEI0" > <name>EEI1</name> <description>Enable Error Interrupt 1</description> <bitOffset>1</bitOffset> </field>
                  <field derivedFrom="EEI0" > <name>EEI2</name> <description>Enable Error Interrupt 2</description> <bitOffset>2</bitOffset> </field>
                  <field derivedFrom="EEI0" > <name>EEI3</name> <description>Enable Error Interrupt 3</description> <bitOffset>3</bitOffset> </field>
                  <field derivedFrom="EEI0" > <name>EEI4</name> <description>Enable Error Interrupt 4</description> <bitOffset>4</bitOffset> </field>
                  <field derivedFrom="EEI0" > <name>EEI5</name> <description>Enable Error Interrupt 5</description> <bitOffset>5</bitOffset> </field>
                  <field derivedFrom="EEI0" > <name>EEI6</name> <description>Enable Error Interrupt 6</description> <bitOffset>6</bitOffset> </field>
                  <field derivedFrom="EEI0" > <name>EEI7</name> <description>Enable Error Interrupt 7</description> <bitOffset>7</bitOffset> </field>
                  <field derivedFrom="EEI0" > <name>EEI8</name> <description>Enable Error Interrupt 8</description> <bitOffset>8</bitOffset> </field>
                  <field derivedFrom="EEI0" > <name>EEI9</name> <description>Enable Error Interrupt 9</description> <bitOffset>9</bitOffset> </field>
                  <field derivedFrom="EEI0" > <name>EEI10</name> <description>Enable Error Interrupt 10</description> <bitOffset>10</bitOffset> </field>
                  <field derivedFrom="EEI0" > <name>EEI11</name> <description>Enable Error Interrupt 11</description> <bitOffset>11</bitOffset> </field>
                  <field derivedFrom="EEI0" > <name>EEI12</name> <description>Enable Error Interrupt 12</description> <bitOffset>12</bitOffset> </field>
                  <field derivedFrom="EEI0" > <name>EEI13</name> <description>Enable Error Interrupt 13</description> <bitOffset>13</bitOffset> </field>
                  <field derivedFrom="EEI0" > <name>EEI14</name> <description>Enable Error Interrupt 14</description> <bitOffset>14</bitOffset> </field>
                  <field derivedFrom="EEI0" > <name>EEI15</name> <description>Enable Error Interrupt 15</description> <bitOffset>15</bitOffset> </field>
               </fields>
            </register>
            <register>
               <name>CEEI</name>
               <description>Clear Enable Error Interrupt Register</description>
               <addressOffset>0x18</addressOffset>
               <size>8</size>
               <access>write-only</access>
               <resetMask>0xFF</resetMask>
               <fields>
                  <field>
                     <name>CEEI</name>
                     <description>Clear Enable Error Interrupt</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>CAEE</name>
                     <description>Clear All Enable Error Interrupts</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Clear only the EEI bit specified in the CEEI field</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Clear all bits in EEI</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>NOP</name>
                     <description>No Op enable</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Normal operation</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>No operation, ignore the other bits in this register</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
