podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/DeviceData/Device.SVD/Internal/peripherals/DMA_MKE16F16.svd.xml
            <register>
               <name>SEEI</name>
               <description>Set Enable Error Interrupt Register</description>
               <addressOffset>0x19</addressOffset>
               <size>8</size>
               <access>write-only</access>
               <resetMask>0xFF</resetMask>
               <fields>
                  <field>
                     <name>SEEI</name>
                     <description>Set Enable Error Interrupt</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>SAEE</name>
                     <description>Sets All Enable Error Interrupts</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Set only the EEI bit specified in the SEEI field</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Sets all bits in EEI</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>NOP</name>
                     <description>No Op enable</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Normal operation</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>No operation, ignore the other bits in this register</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>CERQ</name>
               <description>Clear Enable Request Register</description>
               <addressOffset>0x1A</addressOffset>
               <size>8</size>
               <access>write-only</access>
               <resetMask>0xFF</resetMask>
               <fields>
                  <field>
                     <name>CERQ</name>
                     <description>Clear Enable Request</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>CAER</name>
                     <description>Clear All Enable Requests</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Clear only the ERQ bit specified in the CERQ field</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Clear all bits in ERQ</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>NOP</name>
                     <description>No Op enable</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Normal operation</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>No operation, ignore the other bits in this register</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>SERQ</name>
               <description>Set Enable Request Register</description>
               <addressOffset>0x1B</addressOffset>
               <size>8</size>
               <access>write-only</access>
               <resetMask>0xFF</resetMask>
               <fields>
                  <field>
                     <name>SERQ</name>
                     <description>Set Enable Request</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>SAER</name>
                     <description>Set All Enable Requests</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Set only the ERQ bit specified in the SERQ field</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Set all bits in ERQ</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>NOP</name>
                     <description>No Op enable</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Normal operation</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>No operation, ignore the other bits in this register</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>CDNE</name>
               <description>Clear DONE Status Bit Register</description>
               <addressOffset>0x1C</addressOffset>
               <size>8</size>
               <access>write-only</access>
               <resetMask>0xFF</resetMask>
               <fields>
                  <field>
                     <name>CDNE</name>
                     <description>Clear DONE Bit</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>CADN</name>
                     <description>Clears All DONE Bits</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Clears only the TCDn_CSR[DONE] bit specified in the CDNE field</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Clears all bits in TCDn_CSR[DONE]</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>NOP</name>
                     <description>No Op enable</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Normal operation</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>No operation, ignore the other bits in this register</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>SSRT</name>
               <description>Set START Bit Register</description>
               <addressOffset>0x1D</addressOffset>
               <size>8</size>
               <access>write-only</access>
               <resetMask>0xFF</resetMask>
               <fields>
                  <field>
                     <name>SSRT</name>
                     <description>Set START Bit</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>SAST</name>
                     <description>Set All START Bits (activates all channels)</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Set only the TCDn_CSR[START] bit specified in the SSRT field</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Set all bits in TCDn_CSR[START]</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>NOP</name>
                     <description>No Op enable</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Normal operation</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>No operation, ignore the other bits in this register</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>CERR</name>
               <description>Clear Error Register</description>
               <addressOffset>0x1E</addressOffset>
               <size>8</size>
               <access>write-only</access>
               <resetMask>0xFF</resetMask>
               <fields>
                  <field>
                     <name>CERR</name>
                     <description>Clear Error Indicator</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>CAEI</name>
                     <description>Clear All Error Indicators</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Clear only the ERR bit specified in the CERR field</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Clear all bits in ERR</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>NOP</name>
                     <description>No Op enable</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Normal operation</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>No operation, ignore the other bits in this register</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>CINT</name>
               <description>Clear Interrupt Request Register</description>
               <addressOffset>0x1F</addressOffset>
               <size>8</size>
               <access>write-only</access>
               <resetMask>0xFF</resetMask>
               <fields>
                  <field>
                     <name>CINT</name>
                     <description>Clear Interrupt Request</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>CAIR</name>
                     <description>Clear All Interrupt Requests</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Clear only the INT bit specified in the CINT field</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Clear all bits in INT</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>NOP</name>
                     <description>No Op enable</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Normal operation</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>No operation, ignore the other bits in this register</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>INT</name>
               <description>Interrupt Request Register</description>
               <addressOffset>0x24</addressOffset>
               <fields>
                  <field>
                     <name>INT0</name>
                     <description>Interrupt Request 0</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>The interrupt request for corresponding channel is cleared</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>The interrupt request for corresponding channel is active</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field derivedFrom="INT0" > <name>INT1</name> <description>Interrupt Request 1</description> <bitOffset>1</bitOffset> </field>
                  <field derivedFrom="INT0" > <name>INT2</name> <description>Interrupt Request 2</description> <bitOffset>2</bitOffset> </field>
                  <field derivedFrom="INT0" > <name>INT3</name> <description>Interrupt Request 3</description> <bitOffset>3</bitOffset> </field>
                  <field derivedFrom="INT0" > <name>INT4</name> <description>Interrupt Request 4</description> <bitOffset>4</bitOffset> </field>
                  <field derivedFrom="INT0" > <name>INT5</name> <description>Interrupt Request 5</description> <bitOffset>5</bitOffset> </field>
                  <field derivedFrom="INT0" > <name>INT6</name> <description>Interrupt Request 6</description> <bitOffset>6</bitOffset> </field>
                  <field derivedFrom="INT0" > <name>INT7</name> <description>Interrupt Request 7</description> <bitOffset>7</bitOffset> </field>
                  <field derivedFrom="INT0" > <name>INT8</name> <description>Interrupt Request 8</description> <bitOffset>8</bitOffset> </field>
                  <field derivedFrom="INT0" > <name>INT9</name> <description>Interrupt Request 9</description> <bitOffset>9</bitOffset> </field>
                  <field derivedFrom="INT0" > <name>INT10</name> <description>Interrupt Request 10</description> <bitOffset>10</bitOffset> </field>
                  <field derivedFrom="INT0" > <name>INT11</name> <description>Interrupt Request 11</description> <bitOffset>11</bitOffset> </field>
                  <field derivedFrom="INT0" > <name>INT12</name> <description>Interrupt Request 12</description> <bitOffset>12</bitOffset> </field>
                  <field derivedFrom="INT0" > <name>INT13</name> <description>Interrupt Request 13</description> <bitOffset>13</bitOffset> </field>
                  <field derivedFrom="INT0" > <name>INT14</name> <description>Interrupt Request 14</description> <bitOffset>14</bitOffset> </field>
                  <field derivedFrom="INT0" > <name>INT15</name> <description>Interrupt Request 15</description> <bitOffset>15</bitOffset> </field>
               </fields>
            </register>
            <register>
               <name>ERR</name>
               <description>Error Register</description>
               <addressOffset>0x2C</addressOffset>
               <fields>
                  <field>
                     <name>ERR0</name>
                     <description>Error In Channel 0</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>An error in this channel has not occurred</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>An error in this channel has occurred</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field derivedFrom="ERR0" > <name>ERR1</name> <description>Error In Channel 1</description> <bitOffset>1</bitOffset> </field>
                  <field derivedFrom="ERR0" > <name>ERR2</name> <description>Error In Channel 2</description> <bitOffset>2</bitOffset> </field>
                  <field derivedFrom="ERR0" > <name>ERR3</name> <description>Error In Channel 3</description> <bitOffset>3</bitOffset> </field>
                  <field derivedFrom="ERR0" > <name>ERR4</name> <description>Error In Channel 4</description> <bitOffset>4</bitOffset> </field>
                  <field derivedFrom="ERR0" > <name>ERR5</name> <description>Error In Channel 5</description> <bitOffset>5</bitOffset> </field>
                  <field derivedFrom="ERR0" > <name>ERR6</name> <description>Error In Channel 6</description> <bitOffset>6</bitOffset> </field>
                  <field derivedFrom="ERR0" > <name>ERR7</name> <description>Error In Channel 7</description> <bitOffset>7</bitOffset> </field>
                  <field derivedFrom="ERR0" > <name>ERR8</name> <description>Error In Channel 8</description> <bitOffset>8</bitOffset> </field>
                  <field derivedFrom="ERR0" > <name>ERR9</name> <description>Error In Channel 9</description> <bitOffset>9</bitOffset> </field>
                  <field derivedFrom="ERR0" > <name>ERR10</name> <description>Error In Channel 10</description> <bitOffset>10</bitOffset> </field>
                  <field derivedFrom="ERR0" > <name>ERR11</name> <description>Error In Channel 11</description> <bitOffset>11</bitOffset> </field>
                  <field derivedFrom="ERR0" > <name>ERR12</name> <description>Error In Channel 12</description> <bitOffset>12</bitOffset> </field>
                  <field derivedFrom="ERR0" > <name>ERR13</name> <description>Error In Channel 13</description> <bitOffset>13</bitOffset> </field>
                  <field derivedFrom="ERR0" > <name>ERR14</name> <description>Error In Channel 14</description> <bitOffset>14</bitOffset> </field>
                  <field derivedFrom="ERR0" > <name>ERR15</name> <description>Error In Channel 15</description> <bitOffset>15</bitOffset> </field>
               </fields>
            </register>
