podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/DeviceData/Device.SVD/Internal/peripherals/DMA_MKE16F16.svd.xml
            <register>
               <name>EARS</name>
               <description>Enable Asynchronous Request in Stop Register</description>
               <addressOffset>0x44</addressOffset>
               <fields>
                  <field>
                     <name>EDREQ_0</name>
                     <description>Enable asynchronous DMA request in stop mode for channel 0</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Disable asynchronous DMA request for channel 0</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Enable asynchronous DMA request for channel 0</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>EDREQ_1</name>
                     <description>Enable asynchronous DMA request in stop mode for channel 1</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Disable asynchronous DMA request for channel 1</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Enable asynchronous DMA request for channel 1</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>EDREQ_2</name>
                     <description>Enable asynchronous DMA request in stop mode for channel 2</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Disable asynchronous DMA request for channel 2</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Enable asynchronous DMA request for channel 2</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>EDREQ_3</name>
                     <description>Enable asynchronous DMA request in stop mode for channel 3</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Disable asynchronous DMA request for channel 3</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Enable asynchronous DMA request for channel 3</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>EDREQ_4</name>
                     <description>Enable asynchronous DMA request in stop mode for channel 4</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Disable asynchronous DMA request for channel 4</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Enable asynchronous DMA request for channel 4</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>EDREQ_5</name>
                     <description>Enable asynchronous DMA request in stop mode for channel 5</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Disable asynchronous DMA request for channel 5</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Enable asynchronous DMA request for channel 5</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>EDREQ_6</name>
                     <description>Enable asynchronous DMA request in stop mode for channel 6</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Disable asynchronous DMA request for channel 6</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Enable asynchronous DMA request for channel 6</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>EDREQ_7</name>
                     <description>Enable asynchronous DMA request in stop mode for channel 7</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Disable asynchronous DMA request for channel 7</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Enable asynchronous DMA request for channel 7</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>EDREQ_8</name>
                     <description>Enable asynchronous DMA request in stop mode for channel 8</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Disable asynchronous DMA request for channel 8</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Enable asynchronous DMA request for channel 8</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>EDREQ_9</name>
                     <description>Enable asynchronous DMA request in stop mode for channel 9</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Disable asynchronous DMA request for channel 9</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Enable asynchronous DMA request for channel 9</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>EDREQ_10</name>
                     <description>Enable asynchronous DMA request in stop mode for channel 10</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Disable asynchronous DMA request for channel 10</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Enable asynchronous DMA request for channel 10</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>EDREQ_11</name>
                     <description>Enable asynchronous DMA request in stop mode for channel 11</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Disable asynchronous DMA request for channel 11</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Enable asynchronous DMA request for channel 11</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>EDREQ_12</name>
                     <description>Enable asynchronous DMA request in stop mode for channel 12</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Disable asynchronous DMA request for channel 12</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Enable asynchronous DMA request for channel 12</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>EDREQ_13</name>
                     <description>Enable asynchronous DMA request in stop mode for channel 13</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Disable asynchronous DMA request for channel 13</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Enable asynchronous DMA request for channel 13</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>EDREQ_14</name>
                     <description>Enable asynchronous DMA request in stop mode for channel 14</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Disable asynchronous DMA request for channel 14</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Enable asynchronous DMA request for channel 14</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>EDREQ_15</name>
                     <description>Enable asynchronous DMA request in stop mode for channel 15</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Disable asynchronous DMA request for channel 15</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Enable asynchronous DMA request for channel 15</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <dim>16</dim>
               <dimIncrement>1</dimIncrement>
               <dimIndex>3,2,1,0,7,6,5,4,11,10,9,8,15,14,13,12</dimIndex>
               <name>DCHPRI%s</name>
               <description>Channel n Priority Register</description>
               <addressOffset>0x100</addressOffset>
               <size>8</size>
               <resetMask>0x0</resetMask>
               <fields>
                  <field>
                     <name>CHPRI</name>
                     <description>Channel n Arbitration Priority</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>DPA</name>
                     <description>Disable Preempt Ability</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Channel n can suspend a lower priority channel</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Channel n cannot suspend any channel, regardless of channel priority</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>ECP</name>
                     <description>Enable Channel Preemption</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Channel n cannot be suspended by a higher priority channel&apos;s service request</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Channel n can be temporarily suspended by the service request of a higher priority channel</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <cluster>
               <dim>16</dim>
               <dimIncrement>32</dimIncrement>
               <dimIndex>0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15</dimIndex>
               <name>TCD,@p@a@i_@f</name>
               <addressOffset>0x1000</addressOffset>
               <register>
                  <name>SADDR</name>
                  <description>TCD Source Address</description>
                  <addressOffset>0x0</addressOffset>
                  <resetMask>0x0</resetMask>
                  <fields>
                     <field>
                        <name>SADDR</name>
                        <description>Source Address</description>
                        <bitOffset>0</bitOffset>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>SOFF</name>
                  <description>TCD Signed Source Address Offset</description>
                  <addressOffset>0x4</addressOffset>
                  <size>16</size>
                  <resetMask>0x0</resetMask>
                  <fields>
                     <field>
                        <name>SOFF</name>
                        <description>Source address signed offset</description>
                        <bitOffset>0</bitOffset>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>ATTR</name>
                  <description>TCD Transfer Attributes</description>
                  <addressOffset>0x6</addressOffset>
                  <size>16</size>
                  <resetMask>0x0</resetMask>
                  <fields>
                     <field>
                        <name>DSIZE</name>
                        <description>Destination data transfer size</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>3</bitWidth>
                     </field>
                     <field>
                        <name>DMOD</name>
                        <description>Destination Address Modulo</description>
                        <bitOffset>3</bitOffset>
                        <bitWidth>5</bitWidth>
                     </field>
                     <field>
                        <name>SSIZE</name>
                        <description>Source data transfer size</description>
                        <bitOffset>8</bitOffset>
                        <bitWidth>3</bitWidth>
                        <enumeratedValues>
                           <enumeratedValue>
                              <name>000</name>
                              <description>8-bit</description>
                              <value>0b000</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>001</name>
                              <description>16-bit</description>
                              <value>0b001</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>010</name>
                              <description>32-bit</description>
                              <value>0b010</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>100</name>
                              <description>16-byte burst</description>
                              <value>0b100</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>101</name>
                              <description>32-byte burst</description>
                              <value>0b101</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>SMOD</name>
                        <description>Source Address Modulo</description>
                        <bitOffset>11</bitOffset>
                        <bitWidth>5</bitWidth>
                        <enumeratedValues>
                           <enumeratedValue>
                              <name>0</name>
                              <description>Source address modulo feature is disabled</description>
                              <value>0b00000</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>NBYTES_MLNO</name>
                  <description>TCD Minor Byte Count (Minor Loop Mapping Disabled)</description>
                  <addressOffset>0x8</addressOffset>
                  <resetMask>0x0</resetMask>
                  <fields>
                     <field>
                        <name>NBYTES</name>
                        <description>Minor Byte Transfer Count</description>
                        <bitOffset>0</bitOffset>
                     </field>
                  </fields>
               </register>
